# DifferentLabelsInMultiSegmentDim Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..DifferentLabelsInMultiSegmentDim Property
BuiltInFailures..::..DimensionFailures Class See Also
---
All segments of a multi-segment dimension must be labeled the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DifferentLabelsInMultiSegmentDim { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DifferentLabelsInMultiSegmentDim As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DifferentLabelsInMultiSegmentDim {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace